a = int(input("введи радиус в сантиметриках: ")) # ввод радиуса окружности
b = 2 * a * 3.14 # подсчет длины окружности
c = 3.14 * a ** 2 # подсчет площади круга
d = a * 2 ** 0.5 # формула стороны вписанного квадрата
e = a * 3 ** 0.5 # формула стороны вписанного трегольника
print("длина окружности в см", b) # вывод длины окружности в см
print("длина окружности в метрах", b/100) # вывод длины окружности в м
print("площадь круга  в см", c) # вывод площади круга в см квадратных
print("площадь круга  в метрах", c/10000) # вывод площади круга в метрах квадратных
print("сторона квадрата вписанного в окружность в см: ",d) # вывод стороны вписанного квадрата в см
print("сторона квадрата вписанного в окружность в метрах: ",d/100) # вывод стороны вписанного квадрата в метрах
print("сторона равностороннего треугольника в окружность в см: ",e) # вывод стороны вписанного трегольника в см
print("сторона равностороннего треугольника вписанного в окружность в метрах: ",e/100) # вывод стороны вписанного трегольника в метрах
print("сторона квадрата описанного вокруг окружности в см: ", 2*a) # вывод стороны квадрата описанного вокруг окружности в см
print("сторона квадрата описанного вокруг окружности в метрах: ", 2*a/100) # вывод сторона квадрата описанного вокруг окружности в метрах
print("сторона правильного треугольника описанного вокруг окружности в см: ", 2*a*3**0.5) # вывод сторона правильного треугольника описанного вокруг окружности в см
print("сторона правильного треугольника описанного вокруг окружности в метрах: ", 2*a*3**0.5/100) # вывод сторона правильного треугольника описанного вокруг окружности в метрах
print("сторона правильного восьмиугольника описанного вокруг окружности в см: ", 2*a*(2**0.5-1)) # вывод сторона правильного восьмиугольника описанного вокруг окружности в см
print("сторона правильного восьмиугольника описанного вокруг окружности в метрах: ", 2*a*(2**0.5-1)/100) # вывод сторона правильного восьмиугольника описанного вокруг окружности в метрах